2m3_4mm_wall_H2_test_88/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     rhoReactingBuoyantFoam;

startFrom       startTime;

startTime       0;

endTime         1000;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      3;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2;

maxDeltaT       0.5;

functions
{
    probes_H2_vertical
    {
        type            probes;
        libs            ( sampling );
        writeControl    runTime;
        writeInterval   0.1;
        probeLocations  ( ( 0.45 0 0.204 ) ( 0.45 0 0.444 ) ( 0.45 0 0.564 ) ( 0.45 0 0.684 ) ( 0.45 0 0.804 ) ( 0.45 0 0.924 ) ( 0.45 0 1.044 ) ( 0.45 0 1.164 ) ( 0.45 0 1.284 ) ( 0.45 0 1.404 ) ( 0.45 0 1.524 ) ( 0.45 0 1.644 ) ( 0.45 0 1.764 ) ( 0.45 0 1.884 ) ( 0.45 0 2.004 ) );
        fields          ( H2 );
    }
    probes_H2_vertical_back
    {
        type            probes;
        libs            ( sampling );
        writeControl    runTime;
        writeInterval   0.1;
        probeLocations  ( ( 0 0.45 0.204 ) ( 0 0.45 0.444 ) ( 0 0.45 0.564 ) ( 0 0.45 0.684 ) ( 0 0.45 0.804 ) ( 0 0.45 0.924 ) ( 0 0.45 1.044 ) ( 0 0.45 1.164 ) ( 0 0.45 1.284 ) ( 0 0.45 1.404 ) ( 0 0.45 1.524 ) ( 0 0.45 1.644 ) ( 0 0.45 1.764 ) ( 0 0.45 1.884 ) ( 0 0.45 2.004 ) );
        fields          ( H2 );
    }
    probes_H2_horizontal
    {
        type            probes;
        libs            ( sampling );
        executeControl  runTime;
        executeInterval 0.1;
        writeControl    runTime;
        writeInterval   0.1;
        probeLocations  ( ( 0 0 2.004 ) ( 0.05 0 2.004 ) ( 0.1 0 2.004 ) ( 0.15 0 2.004 ) ( 0.2 0 2.004 ) ( 0.25 0 2.004 ) ( 0.3 0 2.004 ) ( 0.35 0 2.004 ) ( 0.4 0 2.004 ) ( 0.45 0 2.004 ) );
        fields          ( H2 );
    }
    myResiduals
    {
        type            solverInfo;
        libs            ( "libutilityFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 100;
        writeControl    timeStep;
        writeInterval   100;
        fields          ( p_rgh U k epsilon h H2 );
    }
}


// ************************************************************************* //
